
#### Terraform Initialization `success`
#### Terraform Validation `success`

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```
terraform
data.genesyscloud_integration.integration: Reading...
data.genesyscloud_integration.integration: Read complete after 0s [id=b8926249-69b1-4ed2-8c97-8ffc28b02f6d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # genesyscloud_integration_action.function_action will be created
  + resource "genesyscloud_integration_action" "function_action" {
      + category               = "Function Data Actions"
      + config_timeout_seconds = 20
      + contract_input         = jsonencode(
            {
              + properties = {
                  + input = {
                      + type = "integer"
                    }
                }
              + required   = [
                  + "input",
                ]
              + type       = "object"
            }
        )
      + contract_output        = jsonencode(
            {
              + properties = {
                  + result = {
                      + type = "integer"
                    }
                }
              + required   = [
                  + "result",
                ]
              + type       = "object"
            }
        )
      + id                     = (known after apply)
      + integration_id         = "b8926249-69b1-4ed2-8c97-8ffc28b02f6d"
      + name                   = "AGAR Factorial"
      + secure                 = false

      + config_request {
          + request_template     = "${input.rawRequest}"
          + request_type         = "POST"
          + request_url_template = (known after apply)
        }

      + config_response {
          + success_template         = "{ \"result\": ${result}}"
          + translation_map          = {
              + "result" = "$.body"
            }
          + translation_map_defaults = {
              + "result" = "-1"
            }
        }

      + function_config {
          + description     = "Funtion for factorial calculation"
          + file_path       = "factorial.zip"
          + handler         = "dist/src/handler.handler"
          + runtime         = "nodejs22.x"
          + timeout_seconds = 15
          + zip_id          = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
